<div>
  @vite(['Modules/Timecard/resources/css/general/stamp.css', 'Modules/Timecard/resources/js/timecard-clock.js'])
  <div class="flex items-center justify-between px-3">
    <h5 class="font-bold timecard-title">タイムカード</h5>
    <a class="flex items-center text-xs text-[#3289FA] hover:opacity-40" href="{{ route('timecard.index') }}">
      <p>勤怠記録へ</p>
      <img class="h-4 w-4" src="img/icon/transition-link.png" />
    </a>
  </div>
  <div class="timecard-area">
    <p class="date" id="js-current-date">{{ $currentDate }}</p>
    <p class="time-display" id="js-current-time">{{ $currentTime }}</p>
  </div>

  @if ($rule === 'public')
    <div
      class="mx-[15px] flex flex-row items-center justify-between rounded-[10px] bg-[#F7F7F7] px-[15px] py-2 lg:flex-col lg:justify-center lg:py-0">
      <div class="flex flex-col text-[0.9375rem] font-bold lg:flex-row lg:py-2 lg:text-xs">
        <div>共通端末で</div>
        <div>打刻をしてください</div>
      </div>
      <div class="-mb-2 lg:mb-0">
        <svg width="148" height="69" viewBox="0 0 148 69" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path
            d="M19.0704 62.7961C19.0704 62.7961 26.0693 55.8781 26.0693 51.6614C26.0693 47.4448 25.5888 33.6849 27.031 30.3115C28.4732 26.938 36.7676 14.5282 36.7676 14.5282L38.5705 37.0898L28.8339 69.5889L19.0704 62.7961Z"
            fill="#FEDBBE" />
          <path
            d="M33.2728 37.2389C33.2728 37.2389 34.3468 26.1042 35.592 22.6138C36.8372 19.124 37.6665 32.0036 37.6665 32.0036L33.2728 37.2382V37.2389Z"
            fill="#EABD9B" />
          <path
            d="M115.356 51.3647V6.13763C115.356 2.74791 112.614 0 109.233 0L41.7146 0C38.3328 0 35.5913 2.74791 35.5913 6.13763V51.3647C35.5913 54.7544 38.3328 57.5023 41.7146 57.5023L109.233 57.5023C112.614 57.5023 115.356 54.7544 115.356 51.3647Z"
            fill="#253858" />
          <path
            d="M111.664 54.9312L39.2838 54.9312C38.6615 54.9312 38.1565 54.425 38.1565 53.8012V3.70042C38.1565 3.07729 38.6615 2.57111 39.2831 2.57111L111.665 2.57111C112.286 2.57111 112.791 3.07729 112.791 3.70042V53.8018C112.791 54.425 112.286 54.9312 111.665 54.9312H111.664Z"
            fill="#DFE1E5" />
          <path
            d="M112.275 3.15089V54.3527C112.275 54.3854 112.248 54.4175 112.21 54.4175H38.7361C38.6984 54.4175 38.6708 54.3848 38.6708 54.3527V3.15089C38.6708 3.11819 38.6978 3.08612 38.7361 3.08612H112.21C112.248 3.08612 112.276 3.11882 112.276 3.15089H112.275Z"
            fill="#F3F4F6" />
          <path d="M83.5527 3.08545L38.6708 39.4346V27.4882L69.6546 3.08545H83.5527Z" fill="#FAFBFC" />
          <path
            d="M112.275 3.15084V5.41763L56.178 54.418H38.7361C38.6984 54.418 38.6708 54.3853 38.6708 54.3533V46.8914L92.1658 3.08545H112.21C112.247 3.08545 112.275 3.11815 112.275 3.15021V3.15084Z"
            fill="#FAFBFC" />
          <path
            d="M112.275 3.15162V54.3534C112.275 54.3861 112.248 54.4182 112.21 54.4182H38.7361C38.6984 54.4182 38.6708 54.3855 38.6708 54.3534V3.15162C38.6708 3.11892 38.6978 3.08685 38.7361 3.08685H112.21C112.248 3.08685 112.276 3.11955 112.276 3.15162H112.275Z"
            fill="#F7F7F7" />
          <path d="M54.1806 3.08545H38.6708V54.4174H54.1806V3.08545Z" fill="#363A46" />
          <path
            d="M42.6719 17.7262H54.1806V22.6591H42.6719C41.3138 22.6591 40.2109 21.5537 40.2109 20.1923C40.2109 18.831 41.3138 17.7256 42.6719 17.7256V17.7262Z"
            fill="#F7F7F7" />
          <path
            d="M99.3856 6.23883H67.5004C67.0847 6.23883 66.7476 6.57665 66.7476 6.99338V50.5101C66.7476 50.9268 67.0847 51.2647 67.5004 51.2647H99.3856C99.8013 51.2647 100.138 50.9268 100.138 50.5101V6.99338C100.138 6.57665 99.8013 6.23883 99.3856 6.23883Z"
            fill="white" />
          <path
            d="M80.3246 24.6725H72.4223C71.868 24.6725 71.4186 25.1229 71.4186 25.6786V33.5994C71.4186 34.1551 71.868 34.6055 72.4223 34.6055H80.3246C80.879 34.6055 81.3283 34.1551 81.3283 33.5994V25.6786C81.3283 25.1229 80.879 24.6725 80.3246 24.6725Z"
            fill="#45C9FF" />
          <path
            d="M94.4631 24.6725H86.5608C86.0064 24.6725 85.5571 25.1229 85.5571 25.6786V33.5994C85.5571 34.1551 86.0064 34.6055 86.5608 34.6055H94.4631C95.0174 34.6055 95.4668 34.1551 95.4668 33.5994V25.6786C95.4668 25.1229 95.0174 24.6725 94.4631 24.6725Z"
            fill="#F76E80" />
          <path d="M95.4667 38.431H72.0158V39.4377H95.4667V38.431Z" fill="#F7F7F7" />
          <path opacity="0.3" d="M52.6481 29.1356H40.2109V30.1423H52.6481V29.1356Z" fill="#F7F7F7" />
          <path opacity="0.3" d="M52.6481 35.1425H40.2109V36.1492H52.6481V35.1425Z" fill="#F7F7F7" />
          <path opacity="0.3" d="M52.6481 40.6462H40.2109V41.6529H52.6481V40.6462Z" fill="#F7F7F7" />
          <path opacity="0.3" d="M52.6481 46.5355H40.2109V47.5422H52.6481V46.5355Z" fill="#F7F7F7" />
          <path d="M95.4667 41.2053H72.0158V42.212H95.4667V41.2053Z" fill="#F7F7F7" />
          <path d="M95.4667 44.807H72.0158V45.8137H95.4667V44.807Z" fill="#F7F7F7" />
          <path fill-rule="evenodd" clip-rule="evenodd"
            d="M86.5696 20.298C87.4855 19.4353 88.0049 18.2305 88.003 16.9704C88.003 14.4458 85.9611 12.3991 83.4424 12.3991C80.9238 12.3991 78.8818 14.4458 78.8818 16.9704C78.8806 18.2305 79.3994 19.4353 80.3153 20.298C81.1603 21.0984 82.2794 21.5436 83.4424 21.5417C84.6048 21.543 85.724 21.0984 86.5696 20.298ZM80.7042 19.6956C81.3691 18.8612 82.3772 18.3764 83.4431 18.377C84.5082 18.3758 85.5163 18.8612 86.1819 19.6956C85.458 20.4281 84.4719 20.84 83.4431 20.8387C82.4143 20.84 81.4281 20.4281 80.7042 19.6956ZM85.197 15.5638C85.197 16.5347 84.4116 17.3219 83.4431 17.3219C82.4745 17.3219 81.6891 16.5347 81.6891 15.5638C81.6891 14.593 82.4745 13.8057 83.4431 13.8057C84.4116 13.8057 85.197 14.593 85.197 15.5638Z"
            fill="#E8E8E8" />
          <path
            d="M31.2127 38.4549L42.8036 20.005C43.2007 19.3372 44.0852 19.1265 44.7188 19.5749C45.3875 20.0483 46.0042 20.9607 45.7601 22.7119C45.2771 26.174 40.4989 34.879 41.3558 38.2399C42.2127 41.6008 44.0532 46.6695 42.5822 52.6071C41.1111 58.5448 32.8613 68.6023 32.8613 68.6023L27.5404 73.2522L24.0017 65.4904L29.0146 52.8127L31.2133 38.4549H31.2127Z"
            fill="#FEDBBE" />
          <path
            d="M38.568 65.6809L30.2749 82.8872H0C5.62075 76.244 22.2245 56.283 22.2245 56.283C22.2245 56.283 22.8788 56.4836 23.9609 56.8848C24.7514 57.1778 25.7682 57.579 26.9256 58.0939C28.3214 58.712 29.9286 59.493 31.5728 60.4475C33.2176 61.3964 34.9107 62.5137 36.4853 63.8046C37.2105 64.3957 37.908 65.0194 38.568 65.6809Z"
            fill="#5B6B7C" />
          <path
            d="M103.087 59.0126C103.087 59.0126 97.5644 46.7462 95.8864 43.2614C94.2077 39.7767 91.1846 32.4487 90.7085 31.3653C89.7468 29.1765 91.1219 26.2866 93.2128 28.0548C97.1918 31.42 105.485 46.1539 105.485 46.1539C105.485 46.1539 105.125 42.6647 107.164 42.1258C109.202 41.5876 111.057 43.0741 111.057 43.0741C111.057 43.0741 110.925 40.9525 113.203 40.5916C115.481 40.2313 116.715 42.3258 116.715 42.3258C116.715 42.3258 116.317 40.435 118.643 40.3313C121.441 40.2068 123.513 45.1164 124.798 49.0564C125.598 51.5086 129.803 63.5764 131.327 66.2569C132.923 69.067 136.774 73.3132 136.774 73.3132L119.992 81.7239C119.992 81.7239 117.474 77.7581 114.117 75.8353C110.76 73.9125 102.967 68.5049 99.7299 65.1402C96.9183 62.2176 92.7021 56.8465 90.2098 54.8557C89.6082 54.3753 89.59 53.4629 90.169 52.9549C90.972 52.25 92.8903 51.3401 94.808 52.4009C98.2846 54.3237 101.409 58.6511 103.087 59.0114L103.087 59.0126Z"
            fill="#FEDBBE" />
        </svg>
      </div>
    </div>
  @else
    <div class="timerecord-button-area">
      <button class="shape-stamp-in" wire:click="push('in')"
        @if (array_search('in', $buttonStatus) === false) disabled @endif>出勤</button>
      <button class="shape-stamp-out" wire:click="push('out')"
        @if (array_search('out', $buttonStatus) === false) disabled @endif>退勤</button>
    </div>
    <div class="timerecord-button-area">
      <button class="shape-stamp-b-start" wire:click="push('break_start')"
        @if (array_search('break_start', $buttonStatus) === false && array_search('out', $buttonStatus) === false) disabled @endif>休憩開始</button>
      <button class="shape-stamp-b-end" wire:click="push('break_end')"
        @if (array_search('break_end', $buttonStatus) === false) disabled @endif>休憩終了</button>
    </div>
  @endif

  <div class="day-timerecord-area">
    <p class="day-timerecord-title">本日の打刻時間</p>
    @foreach ($workTimes as $workTime)
      <div class="day-timerecord-box">
        <p class="stamp-start">出 勤</p>
        <input class="w-[70%] border-none text-end text-sm focus:border-gray-300 focus:outline-none focus:ring-0"
          value="{{ $workTime->in_time ? \Carbon\Carbon::parse($workTime->in_time)->format('Y/m/d H:i') : '--:--' }}"
          readonly />
      </div>

      <div class="day-timerecord-box">
        <p class="stamp-end">退 勤</p>
        <input class="w-[70%] border-none text-end text-sm focus:border-gray-300 focus:outline-none focus:ring-0"
          value="{{ $workTime->out_time ? \Carbon\Carbon::parse($workTime->out_time)->format('Y/m/d H:i') : '--:--' }}"
          readonly />
      </div>
    @endforeach
    <div class="day-timerecord-box">
      <p class="stamp-break">休 憩</p>
      <input
        class="w-[70%] border-none text-end text-sm outline-none focus:border-transparent focus:outline-none focus:ring-0 focus:ring-transparent"
        value="{{ $breakTime }}" placeholder="--:--" readonly />
    </div>
  </div>
</div>
